export const trainersData = [
  {
    id: 1,
    name: 'Тарас Карпопля',
    age: 25,
    experience: 6,
    specialization: 'Тренер з фітнесу',
    quote: 'Тренування - це шлях до кращої версії себе.',
    imageName: 'taras.jpg',
    gender: 'Male',
    price: 20,
    skills: [
      'Функціональні тренування',
      'Планування тренувального процесу',
      'Корекція техніки виконання вправ',
      'Робота з початківцями',
      'Складання програм для схуднення'
    ]
  },
  {
    id: 2,
    name: 'Олена Силова',
    age: 30,
    experience: 8,
    specialization: 'Тренер з йоги',
    quote: 'Гармонія тіла і душі через рух і дихання.',
    imageName: 'olena.jpg',
    gender: 'Female',
    price: 25,
    skills: [
      'Хатха-йога',
      'Релаксаційні техніки',
      'Дихальні практики',
      'Йога для початківців',
      'Гнучкість та мобільність'
    ]
  },
  {
    id: 3,
    name: 'Іван Бігун',
    age: 28,
    experience: 5,
    specialization: 'Тренер з бігу',
    quote: 'Кожен крок наближає тебе до мети.',
    imageName: 'Ivan.jpg',
    gender: 'Male',
    price: 18,
    skills: [
      'Підготовка до марафону',
      'Бігові техніки',
      'Силова підготовка для бігунів',
      'Корекція постановки стопи',
      'Покращення дихання під час бігу'
    ]
  },
  {
    id: 4,
    name: 'Марія Степаненко',
    age: 27,
    experience: 7,
    specialization: 'Тренер з силових тренувань',
    quote: 'Сила народжується в наполегливості.',
    imageName: 'maria.jpg',
    gender: 'Female',
    price: 22,
    skills: [
      'Силові тренування',
      'Пауерліфтинг основи',
      'Робота з вільною вагою',
      'Програми для набору маси',
      'Жіночі силові тренування'
    ]
  },
  {
    id: 5,
    name: 'Олександр Рак',
    age: 32,
    experience: 10,
    specialization: 'Персональний тренер',
    quote: 'Кожне тренування наближає до мети.',
    imageName: 'oleksandr.jpg',
    gender: 'Male',
    price: 30,
    skills: [
      'Індивідуальні програми',
      'Корекція харчування',
      'HIIT тренування',
      'Супровід прогресу клієнта',
      'Постановка цілей та мотивація'
    ]
  },
  {
    id: 6,
    name: 'Катерина Литвин',
    age: 29,
    experience: 6,
    specialization: 'Тренер з пілатесу',
    quote: 'Контроль і баланс — основа успіху.',
    imageName: 'katerina.jpg',
    gender: 'Female',
    price: 28,
    skills: [
      'Класичний пілатес',
      'Пілатес для спини',
      'Тренування на баланс',
      'Постановка правильної осанки',
      'Глибока робота з мʼязами кора'
    ]
  },
  {
    id: 7,
    name: 'Андрій Шевченко',
    age: 35,
    experience: 12,
    specialization: 'Бокс і бойові мистецтва',
    quote: 'Дисципліна – ключ до успіху.',
    imageName: 'andriy.jpg',
    gender: 'Male',
    price: 35,
    skills: [
      'Бокс (техніка, удари, захист)',
      'Підготовка до змагань',
      'Фізична витривалість',
      'Координаційні тренування',
      'Мішок, лапи, спаринги'
    ]
  },
  {
    id: 8,
    name: 'Людмила Коваль',
    age: 26,
    experience: 4,
    specialization: 'Тренер з кардіо',
    quote: 'Рух — життя!',
    imageName: 'lyudmila.jpg',
    gender: 'Female',
    price: 20,
    skills: [
      'Кардіотренування',
      'Степ-аеробіка',
      'Функціональні комплекси',
      'Схуднення та спалювання жиру',
      'Кардіо для підвищення витривалості'
    ]
  }
];



export const reviewsData = [
  {
    id: 1,
    name: 'Марія Іваненко',
    review:
      'Відмінний тренер! Завдяки його програмі я досягла своїх фітнес-цілей швидше, ніж очікувала.',
    mark: 5,
  },
  {
    id: 2,
    name: 'Олександр Петров',  
    review:
      'Професійний підхід і мотивація на кожному тренуванні. Рекомендую всім!',
      mark: 5,
  },
  {
    id: 3,
    name: 'Ірина Коваленко',
    review:
      'Завдяки цьому тренеру я полюбила спорт і змінила своє життя на краще.',
      mark: 5,
  },
  {
    id: 4,
    name: 'Дмитро Сидоренко',
    review:
      'Чудові тренування і індивідуальний підхід. Відчуваю себе сильнішим і здоровішим!', 
    mark: 5,
    }
] 


export const membershipsData = [
  {
    id: 1,
    name: "Стартовий",
    price: 30, // 1 місяць
    yearPrice: 330, // 12 місяців (економія 30$)
    description: "Ідеально для новачків, які хочуть спробувати тренування.",
    features: [
      "Доступ до тренажерного залу",
      "Кардіо-зона",
      "1 персональна консультація",
      "Тренування без обмежень часу"
    ]
  },
  {
    id: 2,
    name: "Стандарт",
    price: 40,
    yearPrice: 440, // замість 480
    description: "Оптимальний варіант для стабільних тренувань.",
    features: [
      "Доступ до тренажерного залу",
      "Кардіо-зона",
      "Функціональна зона",
      "2 персональні консультації",
      "Знижка 10% на персонального тренера"
    ]
  },
  {
    id: 3,
    name: "Преміум",
    price: 55,
    yearPrice: 600, // замість 660
    description: "Для тих, хто налаштований на серйозний результат.",
    features: [
      "Усі зони залу без обмежень",
      "Групові тренування",
      "Персональна підтримка тренера раз на тиждень",
      "3 консультації з харчування",
      "Знижка 15% на персональні тренування"
    ]
  },
  {
    id: 4,
    name: "VIP",
    price: 80,
    yearPrice: 860, // замість 960
    description: "Максимальний комфорт і найвигідніша пропозиція.",
    features: [
      "Усі зони залу без обмежень",
      "Групові тренування",
      "Персональний тренер 2 рази на тиждень",
      "Складання програми харчування",
      "Розширена зона SPA",
      "Знижка 20% на додаткові послуги"
    ]
  }
];
